import React, { FC } from "react";
import { BsChevronRight } from "react-icons/bs";

const About: FC = () => {
  return (
    <div className="flex flex-col divide-y-2">
      <div className="py-6">
        <div className="flex w-fit flex-row items-center gap-2">
          <p>
            <a className="text-[#1abc9c]" href="/">
              หน้าหลัก
            </a>{" "}
            <BsChevronRight className="inline-block" />{" "}
            <span>เกี่ยวกับเรา</span>
          </p>
        </div>
      </div>
      <div>
        <div className="py-6">
          <div className="mb-4 flex flex-row items-center justify-center">
            <div className="border-b-2 border-primary px-8">
              <h1 className="text-primary">เกี่ยวกับเรา</h1>
            </div>
          </div>
          <p className="mb-4 indent-4">
            สืบเนื่องจากรัฐบาลมีนโยบายด้านการแก้ไขปัญหาความเดือดร้อนของประชาชนโดยยึดหลัก
            “ประชาชนเป็นศูนย์กลางของการแก้ไขปัญหา” โดยคณะรัฐมนตรีได้มีมติ
            เมื่อวันที่ 28 มิถุนายน 2548 และ เมื่อวันที่ 29 พฤศจิกายน 2548
            ได้กำหนดแนวทางการจัดระเบียบของระบบกระบวนการแก้ไขปัญหาตามข้อร้องเรียนของประชาชน
            โดยมอบหมายให้ทุกกระทรวงจัดตั้งศูนย์ประสานการแก้ไขปัญหาตามข้อร้องเรียนของประชาชนขึ้น
            เพื่อเป็นศูนย์กลางของกระทรวงในการรับเรื่องร้องเรียนและประสานการแก้ไขปัญหาข้อร้องเรียนของประชาชน
          </p>
          <p className="mb-4 indent-4">
            รัฐมนตรีว่าการกระทรวงเกษตรและสหกรณ์ (ร้อยเอก ธรรมนัส พรหมเผ่า)
            ได้มอบนโยบายขับเคลื่อนงานกระทรวงเกษตรและสหกรณ์ เมื่อวันที่ 13
            กันยายน 2566 โดยมีนโยบายในการจัดตั้งศูนย์บริการประชาชนภาคการเกษตร
            ดังนั้นเพื่อให้การขับเคลื่อนงานตามนโยบายของกระทรวงเกษตรและสหกรณ์ให้มีความชัดเจนและเป็นรูปธรรม
            สามารถแปลงนโยบายสร้างวิธีทำงานสู่วิธีปฏิบัติให้เป็นไปอย่างมีประสิทธิภาพ
            และเกิดผลสำเร็จตามเจตนารมณ์ที่กำหนดไว้
            กระทรวงเกษตรและสหกรณ์จึงได้จัดตั้งศูนย์บริการประชาชนภาคการเกษตรโดยใช้ชื่อว่า
            “ศูนย์บริการเกษตรพิรุณราช”
            เพื่อให้บริการประชาชนในการขอรับบริการ/ร้องเรียน/ร้องทุกข์
            ที่เกี่ยวข้องในด้านการเกษตร
            ซึ่งได้มีการจัดตั้งศูนย์บริการเกษตรพิรุณราช ในทุกระดับ
            ตั้งแต่ระดับอำเภอ ระดับจังหวัด
            และหน่วยงานกรมในสังกัดกกระทรวงเกษตรและสหกรณ์
            ดังนั้นเพื่อให้การบริหารจัดการ การรับบริการ/ร้องเรียน/ร้องทุกข์
            ด้านการเกษตรของกระทรวงเกษตรและสหกรณ์จึงได้จัดทำแนวทางการใช้งานระบบศูนย์บริการเกษตรพิรุณราช
            เพื่อให้สามารถบันทึกข้อมูล การขอรับบริการ/ร้องเรียน/ร้องทุกข์
            พร้อมทั้งสามารถส่งต่อข้อมูล แสดงสถานการณ์ดำเนินงาน
            และติดตามการรายงานผลการดำเนินงานตามที่เกษตรกรมาขอรับบริการได้อย่างมีประสิทธิภาพ
          </p>
        </div>
      </div>
    </div>
  );
};

export default About;
